Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Loading schemas...
fr: Chargement des schémas...
ko: 스키마 불러오는 중...
tr: Şemalar yükleniyor...
vi: Đang tải schema...
zh_hans: 正在加载 Schema...
zh_hant: 正在載入綱要…

source: What's New
fr: Qu'est-ce qui est nouveau

source: Restore…
fr: Restaurer...
ko: 복원…
tr: Geri Yükle…
vi: Khôi phục…
zh_hans: 恢复…
zh_hant: 還原…

source: Comfortable
fr: Confortable
ko: 여유롭게
tr: Rahat
vi: Thoải mái
zh_hans: 舒适
zh_hant: 寬鬆

source: Profile
fr: Profil
ko: 프로필
tr: Profil
vi: Hồ sơ
zh_hans: 配置
zh_hant: 設定檔

source: Replies count against your Claude subscription limits. You share those limits with claude.ai and your own Claude Code sessions, so running out here stops your work there too.
fr: Les réponses comptent contre vos limites d'abonnement Claude. Vous partagez ces limites avec claude.ai et vos propres sessions de code Claude, donc l'épuisement de ces limites ici arrête également votre travail là-bas.
ko: 답변은 Claude 구독 한도를 사용합니다. 이 한도는 claude.ai 및 사용자의 Claude Code 세션과 공유되므로 여기서 한도를 소진하면 그곳에서도 작업이 중단됩니다.
tr: Yanıtlar Claude abonelik limitlerinizden düşer. Bu limitleri claude.ai ve kendi Claude Code oturumlarınızla paylaşırsınız, bu yüzden burada limiti doldurmak oradaki işinizi de durdurur.
vi: Các câu trả lời được tính vào giới hạn gói Claude của bạn. Bạn dùng chung giới hạn đó với claude.ai và các phiên Claude Code của mình, nên hết hạn mức ở đây cũng làm dừng công việc bên đó.
zh_hans: 回复会计入你的 Claude 订阅额度。该额度与 claude.ai 和你自己的 Claude Code 会话共用，因此在这里用完也会让那边的工作停下来。
zh_hant: 回覆會計入你的 Claude 訂閱額度。該額度與 claude.ai 和你自己的 Claude Code 工作階段共用，因此在這裡用完也會讓那邊的工作停下來。

source: Connect Timeout (seconds)
fr: Délai d'attente de connexion (secondes)
ko: 연결 제한 시간(초)
tr: Bağlanma Zaman Aşımı (saniye)
vi: Thời gian chờ kết nối (giây)
zh_hans: 连接超时（秒）
zh_hant: 連線逾時（秒）

source: Publish %d connections to your team?
fr: Publier %d connexions à votre équipe ?

source: Connected Threads
fr: Tissus connectés
ko: 연결된 스레드
tr: Bağlı İş Parçacıkları
vi: Luồng đã kết nối
zh_hans: 已连接线程
zh_hant: 已連線的執行緒

source: Operation cancelled by user
fr: Opération annulée par l'utilisateur.
ko: 사용자가 작업을 취소함
tr: İşlem kullanıcı tarafından iptal edildi
vi: Thao tác đã bị người dùng hủy
zh_hans: 操作已被用户取消
zh_hant: 使用者已取消操作

source: MongoDB driver has no TLS fallback. Preferred and Required both force TLS. Use Required for MongoDB Atlas and other hosted instances.
fr: Le pilote MongoDB n'a pas de fallback TLS. Les préférences et les exigences forcent tous les deux TLS. Utilisez "Exigé" pour MongoDB Atlas et d'autres instances hébergées.
ko: MongoDB 드라이버에는 TLS 폴백이 없습니다. Preferred와 Required 모두 TLS를 강제합니다. MongoDB Atlas 및 기타 호스팅 인스턴스에는 Required를 사용하십시오.
tr: MongoDB sürücüsünde TLS geri dönüşü yoktur. Tercih Edilen ve Zorunlu'nun ikisi de TLS'yi zorunlu kılar. MongoDB Atlas ve diğer barındırılan sunucular için Zorunlu kullanın.
vi: Driver MongoDB không có cơ chế dự phòng TLS. Preferred và Required đều buộc dùng TLS. Dùng Required cho MongoDB Atlas và các instance được lưu trữ khác.
zh_hans: MongoDB 驱动没有 TLS 回退。“首选”和“必需”都会强制使用 TLS。连接 MongoDB Atlas 和其他托管实例时请使用“必需”。
zh_hant: MongoDB 驅動程式沒有 TLS 後備機制。「偏好」和「必要」都會強制使用 TLS。連接 MongoDB Atlas 與其他託管執行個體時請使用「必要」。

source: No matching activity
fr: Aucune activité correspondante
ko: 일치하는 활동 없음
tr: Eşleşen etkinlik yok
vi: Không có hoạt động khớp
zh_hans: 没有匹配的活动
zh_hant: 沒有符合的活動

source: Describe one table: columns, indexes, foreign keys, DDL, and an approximate row count. Every part is read against the same database and schema.
fr: Décrivez une table : colonnes, index, clés étrangères, DDL et un nombre approximatif de lignes. Chaque partie est lu contre la même base de données et le même schéma.
ko: 한 테이블을 설명합니다: 열, 인덱스, 외래 키, DDL, 대략적인 행 수. 모든 부분은 동일한 데이터베이스와 스키마를 기준으로 읽습니다.
tr: Bir tabloyu açıklar: sütunlar, indeksler, yabancı anahtarlar, DDL ve yaklaşık satır sayısı. Her bölüm aynı veritabanı ve şema üzerinden okunur.
vi: Mô tả một bảng: cột, chỉ mục, khoá ngoại, DDL và số dòng ước tính. Mọi phần đều được đọc trên cùng một cơ sở dữ liệu và schema.
zh_hans: 描述一张表：列、索引、外键、DDL 和大致行数。每一部分都在同一个数据库和 Schema 上读取。
zh_hant: 描述一張資料表：欄位、索引、外鍵、DDL 和大致列數。每一部分都在同一個資料庫和綱要上讀取。

source: Remove Filter
fr: Supprimer le filtre
ko: 필터 제거
tr: Filtreyi Kaldır
vi: Xóa bộ lọc
zh_hans: 移除筛选
zh_hant: 移除篩選

source: Connect from the connection's window in TablePro to review them.
fr: Connectez-vous à partir de la fenêtre de connexion de TablePro pour les consulter.

source: The source driver cannot be read.
fr: Le pilote de source ne peut pas être lu.

source: NOT NULL
fr: PAS NUL

source: Ignore foreign key checks
fr: Ignorer les vérifications des clés étrangères
ko: 외래 키 검사 무시
tr: Yabancı anahtar kontrollerini yoksay
vi: Bỏ qua kiểm tra khóa ngoại
zh_hans: 忽略外键检查
zh_hant: 忽略外鍵檢查

source: Data Type:
fr: Type de données :
ko: 데이터 유형:
tr: Veri Türü:
vi: Kiểu dữ liệu:
zh_hans: 数据类型:
zh_hant: 資料型別：

source: Clear table filter
fr: Effacer le filtre de table
ko: 테이블 필터 지우기
tr: Tablo filtresini temizle
vi: Xóa bộ lọc bảng
zh_hans: 清除表筛选
zh_hant: 清除資料表篩選

source: Fix Error
fr: Corriger l'erreur
ko: 오류 수정
tr: Hatayı Düzelt
vi: Sửa lỗi
zh_hans: 修复错误
zh_hant: 修正錯誤

source: Loading tables…
fr: Chargement des tables...
ko: 테이블 불러오는 중…
tr: Tablolar yükleniyor…
vi: Đang tải bảng…
zh_hans: 正在载入表…
zh_hant: 正在載入資料表…

source: Not started
fr: Pas encore commencé

source: Timed out connecting through the SOCKS proxy at %1$@:%2$@. Check that the proxy is reachable and the credentials are correct.
fr: Déconnexion échouée après un délai de connexion via le proxy SOCKS à %1$@:%2$@. Vérifiez que le proxy est accessible et que les informations de connexion sont correctes.
ko: %1$@:%2$@의 SOCKS 프록시를 통해 연결하는 동안 시간이 초과되었습니다. 프록시에 연결할 수 있는지와 자격 증명이 올바른지 확인하십시오.
tr: %1$@:%2$@ adresindeki SOCKS proxy üzerinden bağlanırken zaman aşımı oluştu. Proxy'ye erişilebildiğini ve kimlik bilgilerinin doğru olduğunu denetleyin.
vi: Hết thời gian chờ khi kết nối qua SOCKS proxy tại %1$@:%2$@. Hãy kiểm tra proxy có truy cập được và thông tin đăng nhập có đúng không.
zh_hans: 通过 %1$@:%2$@ 的 SOCKS 代理连接超时。请检查该代理是否可达、凭据是否正确。
zh_hant: 透過 %1$@:%2$@ 的 SOCKS 代理連線逾時。請檢查該代理是否可連線、認證資訊是否正確。

source: The listener does not know the requested SID
fr: L'auditeur ne connaît pas le SID demandé.
ko: 리스너가 요청한 SID를 인식하지 못합니다
tr: Dinleyici istenen SID'yi tanımıyor
vi: Listener không biết SID được yêu cầu
zh_hans: 侦听器不认识请求的 SID
zh_hant: 接聽程式不認識請求的 SID

source: Run Options
fr: Options de fonctionnement

source: to view data
fr: Pour visualiser les données
ko: 데이터 보기
tr: veriyi görüntülemek için
vi: để xem dữ liệu
zh_hans: 以查看数据
zh_hant: 以檢視資料

source: what arrived is not a database file
fr: Ce qui est arrivé n'est pas un fichier de base de données.
ko: 도착한 것은 데이터베이스 파일이 아닙니다
tr: ulaşan şey bir veritabanı dosyası değil
vi: thứ nhận được không phải tệp cơ sở dữ liệu
zh_hans: 收到的不是数据库文件
zh_hant: 收到的不是資料庫檔案

source: Query history summary for %@
fr: Résumé de l'historique des requêtes pour %@
ko: %@의 쿼리 기록 요약
tr: %@ için sorgu geçmişi özeti
vi: Tóm tắt lịch sử truy vấn của %@
zh_hans: %@ 的查询历史摘要
zh_hant: %@ 的查詢記錄摘要

source: This file is not in a Git repository.
fr: Ce fichier n'est pas dans un référentiel Git.

source: Jump
fr: Sauter

source: 1 connection was imported.
fr: 1 connexion a été importée.
ko: 1개 연결을 가져왔습니다.
tr: 1 bağlantı içe aktarıldı.
vi: 1 kết nối đã được nhập.
zh_hans: 已导入 1 个连接。
zh_hant: 已匯入 1 個連線。

source: This database cannot run this command on this object
fr: Cette base de données ne peut pas exécuter cette commande sur cet objet.

source: Export ER Diagram
fr: Exporter le schéma ER
ko: ER 다이어그램 내보내기
tr: ER Diyagramını Dışa Aktar
vi: Xuất sơ đồ ER
zh_hans: 导出 ER 图
zh_hant: 匯出 ER 圖

source: Cancel Restore Dump?
fr: Annuler la restauration du décompte ?
ko: 복원 덤프를 취소하시겠습니까?
tr: Döküm geri yükleme iptal edilsin mi?
vi: Hủy khôi phục dump?
zh_hans: 要取消恢复转储吗？
zh_hant: 要取消還原備份嗎？

source: The session forwards to this connection's host and port from the target instance, so the target is the bastion rather than the database.
fr: La session renvoie à l'hôte et au port de cette connexion à partir de l'instance cible, donc la cible est le bastion plutôt que la base de données.

source: %@ cannot add or remove a table's constraints.
fr: %@ ne peut pas ajouter ni supprimer les contraintes d’un tableau.

source: %@, preview tab
fr: %@, onglet d'aperçu
ko: %@, 미리보기 탭
tr: %@, önizleme sekmesi
vi: %@, tab xem trước
zh_hans: %@，预览标签页
zh_hant: %@，預覽標籤頁

source: Insert Row Above
fr: Insérer la ligne ci-dessus
ko: 위에 행 삽입
tr: Üste Satır Ekle
vi: Chèn dòng phía trên
zh_hans: 在上方插入行
zh_hant: 在上方插入列

source: Insert Document
fr: Insérer le document

source: List Open Tabs
fr: Liste des onglets ouverts
ko: 열린 탭 목록
tr: Açık Sekmeleri Listele
vi: Liệt kê tab đang mở
zh_hans: 列出已打开的标签页
zh_hant: 列出已開啟的標籤頁

source: TLS certificate expired or near expiry
fr: Le certificat TLS est expiré ou est sur le point d'expirer
ko: TLS 인증서가 만료되었거나 곧 만료됩니다
tr: TLS sertifikasının süresi dolmuş veya dolmak üzere
vi: Chứng chỉ TLS đã hoặc sắp hết hạn
zh_hans: TLS 证书已过期或即将过期
zh_hant: TLS 憑證已過期或即將過期

source: Import Data…
fr: Importer des données...
ko: 데이터 가져오기…
tr: Veri İçe Aktar…
vi: Nhập dữ liệu…
zh_hans: 导入数据…
zh_hant: 匯入資料…

source: Unix Timestamp (milliseconds)
fr: Timestamp Unix (millisecondes)
ko: Unix 타임스탬프(밀리초)
tr: Unix Zaman Damgası (milisaniye)
vi: Unix Timestamp (mili giây)
zh_hans: Unix时间戳（毫秒）
zh_hant: Unix 時間戳記（毫秒）

source: New %@
fr: Nouveau %@
ko: 새 %@
tr: Yeni %@
vi: %@ mới
zh_hans: 新建 %@
zh_hant: 新增 %@

source: Scrollback lines:
fr: Lignes de remontée en arrière :
ko: 스크롤백 줄 수:
tr: Geri kaydırma satırları:
vi: Số dòng cuộn lại:
zh_hans: 回滚行数：
zh_hant: 向後捲動行數：

source: Deactivate this license?
fr: Désactiver cette licence ?
ko: 이 라이선스를 비활성화하시겠습니까?
tr: Bu lisans devre dışı bırakılsın mı?
vi: Hủy kích hoạt giấy phép này?
zh_hans: 要停用此许可证吗？
zh_hant: 要停用此授權嗎？

source: Clear Search
fr: Effacer la recherche
ko: 검색 지우기
tr: Aramayı Temizle
vi: Xóa tìm kiếm
zh_hans: 清除搜索
zh_hant: 清除搜尋

source: Public key authentication failed: %@
fr: L'authentification par clé publique a échoué : %@
ko: 공개 키 인증에 실패했습니다: %@
vi: Xác thực khóa công khai thất bại: %@
zh_hans: 公钥认证失败：%@
zh_hant: 公鑰驗證失敗：%@

source: The target database may be in a partial state. Review it and clean up as needed.
fr: La base de données cible peut être en état partiel. Vérifiez-la et nettoyez-la si nécessaire.

source: Temporarily disable foreign key constraints during import. Useful for importing data with circular dependencies.
fr: Désactive temporairement les contraintes de clé étrangère pendant l'importation. Utile pour importer des données avec des dépendances circulaires.
ko: 가져오는 동안 외래 키 제약 조건을 일시적으로 비활성화합니다. 순환 종속성이 있는 데이터를 가져올 때 유용합니다.
vi: Tạm thời tắt ràng buộc khóa ngoại trong quá trình nhập. Hữu ích khi nhập dữ liệu có phụ thuộc vòng.
zh_hans: 导入时临时禁用外键约束。适用于导入具有循环依赖的数据。
zh_hant: 匯入時暫時停用外鍵限制。適合用於匯入有循環相依關係的資料。

source: Match Any
fr: Correspondre à n'importe lequel
ko: 하나라도 일치
tr: Herhangi Biri Eşleşsin
vi: Khớp bất kỳ
zh_hans: 匹配任一
zh_hant: 符合任一

source: Standalone
fr: Autonome
ko: 단독 실행
tr: Bağımsız
vi: Độc lập
zh_hans: 单机
zh_hant: 單機

source: Current database: %@ (⌘K to switch)
fr: Base de données actuelle : %@ (⌘K pour basculer)
ko: 현재 데이터베이스: %@ (전환하려면 ⌘K)
tr: Mevcut veritabanı: %@ (değiştirmek için ⌘K)
vi: Cơ sở dữ liệu hiện tại: %@ (⌘K để chuyển)
zh_hans: 当前数据库：%@（⌘K 切换）
zh_hant: 目前的資料庫：%@（⌘K 切換）

source: Object kinds this operation may name, as list_tables reports them. Empty when it acts on the whole database only.
fr: Types d'objets que cette opération peut nommer, comme les rapporte list_tables. Vide lorsqu'elle agit uniquement sur toute la base de données.

source: Whether its query can be cancelled
fr: Si la requête peut être annulée
ko: 쿼리를 취소할 수 있는지 여부
tr: Sorgusunun iptal edilip edilemeyeceği
vi: Truy vấn của nó có huỷ được hay không
zh_hans: 它的查询是否可以取消
zh_hant: 它的查詢是否可以取消

source: Warehouse
fr: Entrepôt
ko: 웨어하우스
zh_hans: 仓库
zh_hant: 倉儲

source: Enter a name.
fr: Entrez un nom.

source: Identifier case
fr: Carte d'identification
ko: 식별자 대소문자
tr: Tanımlayıcı büyük/küçük harf
vi: Kiểu chữ của định danh
zh_hans: 标识符大小写
zh_hant: 識別碼大小寫

source: Explain a schema
fr: Expliquez un schéma
ko: 스키마 설명
tr: Bir şemayı açıkla
vi: Giải thích một schema
zh_hans: 讲解一个 Schema
zh_hant: 講解一個綱要

source: Waiting on you
fr: En attendant toi

source: Drop Database
fr: Déposer la base de données
ko: 데이터베이스 삭제
tr: Veritabanını Sil
vi: Xoá cơ sở dữ liệu
zh_hans: 删除数据库
zh_hant: 刪除資料庫

source: Filter Settings
fr: Paramètres de filtrage
ko: 필터 설정
tr: Filtre Ayarları
vi: Cài đặt bộ lọc
zh_hans: 筛选设置
zh_hant: 篩選設定

source: Ready
fr: Prêt

source: Toggle Workspace Rail
fr: Changer la voie de travail
ko: 작업 공간 레일 표시/숨기기
tr: Çalışma Alanı Şeridini Aç/Kapat
vi: Bật/tắt thanh không gian làm việc
zh_hans: 切换工作区栏
zh_hant: 切換工作區列

source: Will be dropped when you apply changes
fr: Sera supprimé lorsque vous appliquerez des modifications.
ko: 변경 사항을 적용하면 삭제됩니다
tr: Değişiklikleri uyguladığınızda silinecek
vi: Sẽ bị xoá khi bạn áp dụng thay đổi
zh_hans: 应用更改时将会删除
zh_hant: 套用變更時將會刪除

source: Result view
fr: Vue des résultats

source: Tool call limit: %d
fr: Limite d'appels d'outils : %d
ko: 도구 호출 한도: %d
tr: Araç çağrısı limiti: %d
vi: Giới hạn gọi công cụ: %d
zh_hans: 工具调用上限：%d
zh_hant: 工具呼叫上限：%d

source: The connection was lost while committing, so this may not be saved.
fr: La connexion a été perdue lors de la tentative de sauvegarde, il se peut donc que cela ne soit pas sauvegardé.

source: This license expires tomorrow.
fr: Cette licence expire demain.
ko: 이 라이선스는 내일 만료됩니다.
tr: Bu lisansın süresi yarın doluyor.
vi: Giấy phép này hết hạn vào ngày mai.
zh_hans: 此许可证明天过期。
zh_hant: 此授權明天到期。

source: A file
fr: Un fichier

source: Billing:
fr: Facturation :
ko: 결제:
tr: Faturalandırma:
vi: Thanh toán:
zh_hans: 账单：
zh_hant: 帳單：

source: Column %d
fr: Colonne %d

source: Confirmation is required for this operation
fr: La confirmation est requise pour cette opération.
ko: 이 작업은 확인이 필요합니다
tr: Bu işlem için onay gerekiyor
vi: Thao tác này yêu cầu xác nhận
zh_hans: 此操作需要确认
zh_hant: 此操作需要確認

source: The CREATE statement
fr: La déclaration CREATE

source: Move to End of Document
fr: Se déplacer vers la fin du document
ko: 문서 끝으로 이동
tr: Belgenin Sonuna Git
vi: Đến cuối tài liệu
zh_hans: 移到文稿末尾
zh_hant: 移到文件結尾

source: cancelling a server query
fr: Annulation d'une requête du serveur
ko: 서버 쿼리 취소
tr: bir sunucu sorgusunu iptal etme
vi: huỷ một truy vấn trên máy chủ
zh_hans: 取消一个服务器查询
zh_hant: 取消一個伺服器查詢

source: Schema now selected
fr: Schéma maintenant sélectionné
ko: 현재 선택된 스키마
tr: Şu anda seçili şema
vi: Schema đang được chọn
zh_hans: 当前已选中的 Schema
zh_hant: 目前已選取的綱要

source: What a function returns, absent for a procedure
fr: Quelle fonction renvoie, absente pour une procédure
ko: 함수가 반환하는 값이며 프로시저에는 없습니다
tr: Bir fonksiyonun döndürdüğü şey, yordamlarda bulunmaz
vi: Thứ mà một hàm trả về, không có với procedure
zh_hans: 函数的返回值，存储过程没有这一项
zh_hant: 函式的回傳值，預存程序沒有這一項

source: The following plugins were rejected: %@ Please update them from the plugin registry.
fr: Les plugins suivants ont été rejetés : %@ Veuillez les mettre à jour à partir du registre des plugins.
ko: 다음 플러그인이 거부되었습니다. %@ 플러그인 레지스트리에서 업데이트하십시오.
tr: Aşağıdaki eklentiler reddedildi: %@ Lütfen eklenti kayıt defterinden güncelleyin.
vi: Các plugin sau bị từ chối: %@ Vui lòng cập nhật chúng từ kho plugin.
zh_hans: 以下插件被拒绝： %@ 请从插件注册表中更新它们。
zh_hant: 下列外掛已遭拒絕： %@ 請從外掛註冊更新它們。

source: Plugin was built for PluginKit version %1$d; this release of TablePro needs version %2$d.
fr: Le plugin a été construit pour la version PluginKit %1$d ; cette version de TablePro nécessite la version %2$d.
ko: 플러그인은 PluginKit %1$d 버전용으로 빌드되었지만 이 TablePro 릴리스에는 %2$d 버전이 필요합니다.
tr: Eklenti, PluginKit %1$d sürümü için derlenmiş; TablePro'nun bu sürümü %2$d sürümünü gerektiriyor.
vi: Plugin được xây dựng cho PluginKit phiên bản %1$d; bản phát hành TablePro này cần phiên bản %2$d.
zh_hans: 插件是为 PluginKit 版本 %1$d 构建的；此版本的 TablePro 需要版本 %2$d。
zh_hant: 外掛是為 PluginKit 版本 %1$d 建置的；此版本的 TablePro 需要版本 %2$d。

source: Preparing the metadata connection timed out.
fr: La préparation de la connexion des métadonnées a échoué.
ko: 메타데이터 연결을 준비하는 동안 시간이 초과되었습니다.
tr: Meta veri bağlantısı hazırlanırken zaman aşımına uğradı.
vi: Việc chuẩn bị kết nối metadata đã hết thời gian chờ.
zh_hans: 准备元数据连接超时。
zh_hant: 準備中繼資料連線逾時。

source: Search columns…
fr: Rechercher des colonnes...
ko: 열 검색…
tr: Sütunlarda ara…
vi: Tìm cột…
zh_hans: 搜索列…
zh_hant: 搜尋欄位…

source: Filtered to %lld of %lld ^[rows](inflect: true)
fr: Filtré à %lld de %lld ^[rows](inflect: true)
ko: %lld / %lld개 행으로 필터됨
tr: %lld / %lld satır filtrelendi
vi: Đã lọc còn %lld trên %lld hàng
zh_hans: 已筛选 %lld / %lld 行
zh_hant: 已篩選 %lld / %lld 列

source: The Cursor CLI is not installed.
fr: Le CLI Cursor n'est pas installé.
ko: Cursor CLI가 설치되어 있지 않습니다.
tr: Cursor CLI yüklü değil.
vi: Cursor CLI chưa được cài đặt.
zh_hans: 未安装 Cursor CLI。
zh_hant: 尚未安裝 Cursor CLI。

source: Required only for an encrypted key
fr: Nécessaire uniquement pour une clé cryptée
ko: 암호화된 키에만 필요
tr: Yalnızca şifreli bir anahtar için gerekli
vi: Chỉ cần cho khóa được mã hóa
zh_hans: 仅加密密钥需要
zh_hant: 僅加密金鑰需要

source: VERBOSE (print progress)
fr: VERBOSE (impression du progrès)
ko: VERBOSE (진행 상황 출력)
tr: VERBOSE (ilerlemeyi yazdır)
vi: VERBOSE (in tiến trình)
zh_hans: VERBOSE（打印进度）
zh_hant: VERBOSE（輸出進度）

source: Bool True
fr: Vrai
ko: 불리언 True
tr: Bool Doğru
zh_hans: 布尔值 True
zh_hant: 布林值 True

source: 1 plugin could not be loaded.
fr: 1 plugin n'a pas pu être chargé.
ko: 1개 플러그인을 불러올 수 없습니다.
tr: 1 eklenti yüklenemedi.
vi: Không thể tải 1 plugin.
zh_hans: 1个插件无法加载。
zh_hant: 1 個外掛無法載入。

source: Project ID
fr: ID du projet
ko: 프로젝트 ID
tr: Proje ID
zh_hans: 项目 ID
zh_hant: 專案 ID

source: Comma ,
fr: Point virgule,
ko: 쉼표 ,
tr: Virgül ,
vi: Dấu phẩy ,
zh_hans: 逗号 ,
zh_hant: 逗號 ,

source: Run the command in Terminal to see what it reports.
fr: Exécutez la commande dans le terminal pour voir ce qu'elle rapporte.

source: Custom Command
fr: Commande personnalisée

source: Client Cert
fr: Certificat client
ko: 클라이언트 인증서
tr: İstemci Sertifikası
vi: Chứng chỉ máy khách
zh_hans: 客户端证书
zh_hant: 用戶端憑證

source: Type name
fr: Type de nom

source: Update TablePro
fr: Mise à jour de TablePro
ko: TablePro 업데이트
tr: TablePro'yu Güncelle
vi: Cập nhật TablePro
zh_hans: 更新 TablePro
zh_hant: 更新 TablePro

source: Could not fetch the view definition:
fr: Impossible de récupérer la définition de la vue :

source: Enable filter
fr: Activer le filtre
ko: 필터 활성화
tr: Filtreyi etkinleştir
vi: Bật bộ lọc
zh_hans: 启用筛选
zh_hant: 啟用篩選

source: Table that received the rows
fr: Table qui a reçu les lignes
ko: 행을 받은 테이블
tr: Satırları alan tablo
vi: Bảng đã nhận các dòng
zh_hans: 接收这些行的表
zh_hant: 接收這些列的資料表

source: Previous Statement
fr: Déclaration précédente
ko: 이전 문
tr: Önceki İfade
vi: Câu lệnh trước
zh_hans: 上一条语句
zh_hant: 上一個陳述式

source: Selected SSH profile no longer exists.
fr: Le profil SSH sélectionné n'existe plus.
ko: 선택한 SSH 프로필이 더 이상 존재하지 않습니다.
tr: Seçilen SSH profili artık mevcut değil.
vi: Hồ sơ SSH đã chọn không còn tồn tại.
zh_hans: 所选 SSH 配置已不存在。
zh_hant: 選取的 SSH 設定檔已不存在。

source: Cell
fr: Cellule

source: Full-width letters or digits. SQL needs the ASCII %@.
fr: Lettres ou chiffres de largeur complète. SQL a besoin du %@ ASCII.
ko: 전각 문자 또는 숫자. SQL은 ASCII %@만 인식합니다.
tr: Tam genişlikte harf veya rakam. SQL, ASCII %@ bekler.
vi: Chữ hoặc số toàn độ rộng. SQL cần %@ ASCII.
zh_hans: 全角字母或数字。SQL 需要 ASCII %@。
zh_hant: 全形字母或數字。SQL 需要 ASCII %@。

source: Same
fr: Même
ko: 동일
tr: Aynı
vi: Giống nhau
zh_hans: 相同
zh_hant: 相同

source: No file at %@ on the server.
fr: Aucun fichier à %@ sur le serveur.
ko: 서버의 %@에 파일이 없습니다.
tr: Sunucuda %@ konumunda dosya yok.
vi: Không có tệp tại %@ trên máy chủ.
zh_hans: 服务器上 %@ 处没有文件。
zh_hant: 伺服器上 %@ 處沒有檔案。

source: Length
fr: Longueur
ko: 길이
tr: Uzunluk
vi: Độ dài
zh_hans: 长度
zh_hant: 長度

source: Failed to fetch models from %@
fr: Échec de la récupération des modèles de %@
ko: %@에서 모델을 가져오지 못했습니다
tr: Şuradan modeller alınamadı: %@
vi: Không thể lấy danh sách model từ %@
zh_hans: 无法从 %@ 获取模型
zh_hant: 無法從 %@ 擷取模型

source: %1$@ does not apply to a %2$@.
fr: %1$@ ne s'applique pas à un %2$@.

source: AWS managed key-value/document store
fr: Stockage de clés/valeurs/documents géré par AWS
ko: AWS 관리형 키-값/문서 저장소
tr: AWS'nin yönettiği anahtar-değer/belge deposu
vi: Kho key-value/tài liệu do AWS quản lý
zh_hans: AWS托管的键值/文档存储
zh_hant: AWS 託管的鍵值／文件儲存

source: List the tabs open in TablePro for connections this client may reach. Each entry carries the tab id that focus_query_tab takes and the window id that open_table_tab returns.
fr: Listez les onglets ouverts dans TablePro pour les connexions que ce client peut atteindre. Chaque entrée contient l'identifiant de l'onglet que focus_query_tab prend et l'identifiant de la fenêtre que open_table_tab renvoie.
ko: 이 클라이언트가 접근할 수 있는 연결에 대해 TablePro에 열려 있는 탭을 나열합니다. 각 항목에는 focus_query_tab이 받는 탭 id와 open_table_tab이 반환하는 창 id가 들어 있습니다.
tr: Bu istemcinin erişebildiği bağlantılar için TablePro'da açık olan sekmeleri listeler. Her girdi, focus_query_tab'in aldığı sekme kimliğini ve open_table_tab'in döndürdüğü pencere kimliğini taşır.
vi: Liệt kê các tab đang mở trong TablePro cho những kết nối mà client này truy cập được. Mỗi mục mang tab id mà focus_query_tab nhận và window id mà open_table_tab trả về.
zh_hans: 列出 TablePro 中为此客户端可访问的连接打开的标签页。每一项都带有 focus_query_tab 接受的标签页 id 和 open_table_tab 返回的窗口 id。
zh_hant: 列出 TablePro 中為此用戶端可存取的連線開啟的標籤頁。每一項都帶有 focus_query_tab 接受的標籤頁 id 和 open_table_tab 回傳的視窗 id。

source: Empty Redis command
fr: Commande Redis vide
ko: 빈 Redis 명령
tr: Boş Redis komutu
vi: Lệnh Redis trống
zh_hans: Redis 命令为空
zh_hant: Redis 命令為空

source: Every targeted cell gets this value.
fr: Chaque cellule ciblée reçoit cette valeur.

source: Set EMPTY
fr: Définir VIDE
ko: EMPTY로 설정
vi: Đặt TRỐNG
zh_hans: 设为空
zh_hant: 設為空

source: Open %@...
fr: Ouvrir %@...
ko: %@ 열기...
tr: %@ Aç...
vi: Mở %@...
zh_hans: 打开 %@...
zh_hant: 開啟 %@...

source: Select a row or table to view details
fr: Sélectionnez une ligne ou une table pour afficher les détails.
ko: 세부사항을 볼 행 또는 테이블을 선택하십시오
tr: Ayrıntıları görmek için bir satır veya tablo seçin
vi: Chọn một hàng hoặc bảng để xem chi tiết
zh_hans: 选择一行或一个表以查看详情
zh_hant: 選擇一列或資料表以檢視詳細資訊

source: %lld more result sets were not kept.
fr: %lld autres ensembles de résultats n'ont pas été conservés.

source: Not in this result
fr: Pas dans ce résultat

source: The database is a copy of a file on the SSH server, and changes are never written back, so the connection is always Read-Only.
fr: La base de données est une copie d'un fichier sur le serveur SSH, et les modifications ne sont jamais réécrites, de sorte que la connexion est toujours en lecture seule.

source: Close preview
fr: Fermer l'aperçu
ko: 미리보기 닫기
tr: Önizlemeyi kapat
vi: Đóng xem trước
zh_hans: 关闭预览
zh_hant: 關閉預覽

source: Identity and auto-increment values are written as they are. A column the server generates always may refuse them.
fr: Les valeurs d'identité et d'auto-incrémentation sont écrites telles quelles. Une colonne que le serveur génère peut toujours les refuser.

source: Copied
fr: Copié
ko: 복사됨
tr: Kopyalandı
vi: Đã sao chép
zh_hans: 已复制
zh_hant: 已複製

source: Any statement in the batch that ran stays applied.
fr: Toute déclaration dans le lot qui a été exécuté reste appliquée.

source: Use as Active %@
fr: Utiliser comme %@ actif
ko: 활성 %@(으)로 사용
tr: Etkin %@ Olarak Kullan
vi: Dùng làm %@ hiện hành
zh_hans: 设为当前%@
zh_hant: 設為使用中的%@

source: Active
fr: Actif
ko: 활성
tr: Etkin
vi: Đang hoạt động
zh_hans: 活跃
zh_hant: 使用中

source: API Token Required
fr: Token API requis
ko: API 토큰 필요
tr: API Anahtarı Gerekli
vi: Yêu cầu mã API
zh_hans: 需要 API 令牌
zh_hant: 需要 API 權杖

source: per second
fr: Par seconde

source: 1 row
fr: 1 rangée
